In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('TEst.csv')

In [3]:
df

   Employee ID Name  Salary
0            1    a      80
1            2    v     100
2            3    v     101
3            4    d     201

In [4]:
df[df['Salary']<100]

   Employee ID Name  Salary
0            1    a      80

In [23]:
df['concat']=df.apply(lambda df: str(df['Name'])+str(df['Salary']),axis=1)

In [11]:
def concat(a,b):
    return str(a)+str(b)

In [12]:
concat('a','b')

'ab'

In [20]:
df['combined']=df.apply(lambda x:concat(x['Name'],x['Salary']),axis=1)

In [21]:
df

   Employee ID Name  Salary combined
0            1    a      80      a80
1            2    v     100     v100
2            3    v     101     v101
3            4    d     201     d201